;;2022-02-21 07:53
;;(jma-forecast-data "070000")

[
 ((publishingOffice . "福島地方気象台")
  (reportDatetime . "2022-02-21T05:00:00+09:00")
  (timeSeries
   . [
      ((timeDefines . ["2022-02-21T05:00:00+09:00" "2022-02-22T00:00:00+09:00"])
       (areas
        . [
           ;; class10s
           ((area (name . "中通り") (code . "070010")) (weatherCodes . ["205" "201"]) (weathers . ["くもり　昼過ぎ　まで　時々　雪　で　ふぶく" "くもり　時々　晴れ　所により　雪"]) (winds . ["西の風　やや強く" "西の風　日中　北西の風"]))
           ((area (name . "浜通り") (code . "070020")) (weatherCodes . ["101" "101"]) (weathers . ["晴れ　時々　くもり　所により　昼前　まで　雪" "晴れ　時々　くもり　所により　昼前　から　雪"]) (winds . ["西の風　やや強く　海上　では　西の風　強く" "北西の風　海上　では　はじめ　西の風　強く"]) (waves . ["３メートル　後　２．５メートル" "２メートル"]))
           ((area (name . "会津") (code . "070030")) (weatherCodes . ["400" "400"]) (weathers . ["雪　で　ふぶく" "雪"]) (winds . ["西の風　日中　やや強く" "西の風"]))])
       )
      ((timeDefines . ["2022-02-21T06:00:00+09:00" "2022-02-21T12:00:00+09:00" "2022-02-21T18:00:00+09:00" "2022-02-22T00:00:00+09:00" "2022-02-22T06:00:00+09:00" "2022-02-22T12:00:00+09:00" "2022-02-22T18:00:00+09:00"])
       (areas
        . [
           ;; class10s
           ((area (name . "中通り") (code . "070010")) (pops . ["30" "40" "20" "20" "20" "30" "30"]))
           ((area (name . "浜通り") (code . "070020")) (pops . ["20" "10" "10" "10" "20" "20" "20"]))
           ((area (name . "会津") (code . "070030")) (pops . ["80" "70" "70" "60" "50" "60" "70"]))
           ])
       )
      ((timeDefines . ["2022-02-21T09:00:00+09:00" "2022-02-21T00:00:00+09:00" "2022-02-22T00:00:00+09:00" "2022-02-22T09:00:00+09:00"])
       (areas
        . [
           ;; amedas
           ((area (name . "福島") (code . "36127")) (temps . ["1" "1" "-2" "2"]))
           ((area (name . "小名浜") (code . "36846")) (temps . ["4" "4" "-3" "6"]))
           ((area (name . "若松") (code . "36361")) (temps . ["1" "1" "-3" "1"]))
           ((area (name . "白河") (code . "36667")) (temps . ["1" "1" "-4" "3"]))
           ((area (name . "郡山") (code . "36476")) (temps . ["0" "0" "-4" "2"]))
           ((area (name . "相馬") (code . "36151")) (temps . ["2" "2" "-4" "3"]))
           ((area (name . "田島") (code . "36641")) (temps . ["-4" "-4" "-7" "-2"]))
           ])
       )
      ]))

 ((publishingOffice . "福島地方気象台")
  (reportDatetime . "2022-02-20T17:00:00+09:00")
  (timeSeries
   . [
      ((timeDefines . ["2022-02-21T00:00:00+09:00" "2022-02-22T00:00:00+09:00" "2022-02-23T00:00:00+09:00" "2022-02-24T00:00:00+09:00" "2022-02-25T00:00:00+09:00" "2022-02-26T00:00:00+09:00" "2022-02-27T00:00:00+09:00"])
       (areas
        . [
           ;; ????
           ((area (name . "中通り・浜通り") (code . "070100")) (weatherCodes . ["201" "200" "201" "101" "101" "101" "201"]) (pops . ["" "40" "20" "20" "20" "20" "30"]) (reliabilities . ["" "" "A" "A" "A" "A" "A"]))
           ;; class10s
           ((area (name . "会津") (code . "070030")) (weatherCodes . ["400" "402" "205" "204" "200" "200" "206"]) (pops . ["" "80" "70" "50" "40" "30" "60"]) (reliabilities . ["" "" "A" "C" "B" "B" "C"]))
           ])
       )
      ((timeDefines . ["2022-02-21T00:00:00+09:00" "2022-02-22T00:00:00+09:00" "2022-02-23T00:00:00+09:00" "2022-02-24T00:00:00+09:00" "2022-02-25T00:00:00+09:00" "2022-02-26T00:00:00+09:00" "2022-02-27T00:00:00+09:00"])
       (areas
        . [
           ;; amedas
           ((area (name . "福島") (code . "36127")) (tempsMin . ["" "-2" "-3" "-2" "2" "1" "2"]) (tempsMinUpper . ["" "-1" "-2" "0" "3" "3" "3"]) (tempsMinLower . ["" "-5" "-5" "-4" "0" "-4" "-3"]) (tempsMax . ["" "3" "2" "6" "9" "13" "11"]) (tempsMaxUpper . ["" "5" "4" "8" "12" "15" "15"]) (tempsMaxLower . ["" "1" "0" "3" "7" "10" "9"]))
           ((area (name . "若松") (code . "36361")) (tempsMin . ["" "-3" "-4" "-3" "-1" "-3" "-2"]) (tempsMinUpper . ["" "-2" "-3" "-2" "1" "-1" "1"]) (tempsMinLower . ["" "-9" "-6" "-5" "-6" "-9" "-7"]) (tempsMax . ["" "1" "0" "2" "6" "9" "8"]) (tempsMaxUpper . ["" "3" "2" "4" "8" "12" "11"]) (tempsMaxLower . ["" "-2" "-3" "-1" "4" "7" "6"]))
           ])
       )
      ])
  (tempAverage (areas . [((area (name . "福島") (code . "36127")) (min . "-0.7") (max . "8.1")) ((area (name . "若松") (code . "36361")) (min . "-2.8") (max . "5.2"))]))
  (precipAverage (areas . [((area (name . "福島") (code . "36127")) (min . "3.4") (max . "14.0")) ((area (name . "若松") (code . "36361")) (min . "9.5") (max . "21.1"))]))
  )
 ]

