;;(jma-forecast-get "200000")

[
 (
  (publishingOffice . "長野地方気象台")
  (reportDatetime . "2022-02-25T08:00:00+09:00")
  (timeSeries
   . [
      ((timeDefines . ["2022-02-25T05:00:00+09:00" "2022-02-26T00:00:00+09:00"])
       (areas
        . [
           ((area (name . "北部") (code . "200010")) (weatherCodes . ["101" "100"]) (weathers . ["晴れ　時々　くもり" "晴れ　夜　くもり"]) (winds . ["南の風　後　北の風" "南の風"]))
           ((area (name . "中部") (code . "200020")) (weatherCodes . ["101" "100"]) (weathers . ["晴れ　時々　くもり" "晴れ　夜　くもり"]) (winds . ["南の風　後　北の風" "南の風"]))
           ((area (name . "南部") (code . "200030")) (weatherCodes . ["101" "100"]) (weathers . ["晴れ　時々　くもり" "晴れ　夜　くもり"]) (winds . ["北の風　日中　南の風" "北の風　後　南の風"]))
           ])
       )
      ((timeDefines . ["2022-02-25T06:00:00+09:00" "2022-02-25T12:00:00+09:00" "2022-02-25T18:00:00+09:00" "2022-02-26T00:00:00+09:00" "2022-02-26T06:00:00+09:00" "2022-02-26T12:00:00+09:00" "2022-02-26T18:00:00+09:00"])
       (areas
        . [
           ((area (name . "北部") (code . "200010")) (pops . ["20" "20" "10" "10" "0" "0" "10"]))
           ((area (name . "中部") (code . "200020")) (pops . ["10" "10" "0" "0" "0" "0" "10"]))
           ((area (name . "南部") (code . "200030")) (pops . ["0" "10" "0" "0" "0" "0" "10"]))
           ]))
      ((timeDefines . ["2022-02-25T09:00:00+09:00" "2022-02-25T00:00:00+09:00" "2022-02-26T00:00:00+09:00" "2022-02-26T09:00:00+09:00"])
       (areas
        . [
           ((area (name . "長野") (code . "48156")) (temps . ["5" "5" "-6" "9"]))
           ((area (name . "松本") (code . "48361")) (temps . ["6" "6" "-6" "10"]))
           ((area (name . "諏訪") (code . "48491")) (temps . ["5" "5" "-7" "8"]))
           ((area (name . "飯田") (code . "48767")) (temps . ["8" "8" "-5" "10"]))
           ((area (name . "軽井沢") (code . "48331")) (temps . ["3" "3" "-10" "6"]))
           ]))
      ])
  )

 (
  (publishingOffice . "長野地方気象台")
  (reportDatetime . "2022-02-24T17:00:00+09:00")
  (timeSeries
   . [
      ((timeDefines . ["2022-02-25T00:00:00+09:00" "2022-02-26T00:00:00+09:00" "2022-02-27T00:00:00+09:00" "2022-02-28T00:00:00+09:00" "2022-03-01T00:00:00+09:00" "2022-03-02T00:00:00+09:00" "2022-03-03T00:00:00+09:00"])
       (areas
        . [
           ((area (name . "北部") (code . "200010")) (weatherCodes . ["101" "101" "260" "201" "260" "201" "201"]) (pops . ["" "10" "50" "20" "50" "30" "30"]) (reliabilities . ["" "" "C" "A" "C" "A" "B"]))
           ((area (name . "中部・南部") (code . "200100")) (weatherCodes . ["101" "101" "201" "101" "200" "201" "201"]) (pops . ["" "10" "30" "10" "40" "30" "30"]) (reliabilities . ["" "" "B" "A" "C" "A" "A"]))
           ])
       )
      ((timeDefines . ["2022-02-25T00:00:00+09:00" "2022-02-26T00:00:00+09:00" "2022-02-27T00:00:00+09:00" "2022-02-28T00:00:00+09:00" "2022-03-01T00:00:00+09:00" "2022-03-02T00:00:00+09:00" "2022-03-03T00:00:00+09:00"])
       (areas
        . [
           ((area (name . "長野") (code . "48156")) (tempsMin . ["" "-8" "-2" "-3" "-2" "-2" "-2"]) (tempsMinUpper . ["" "-4" "0" "0" "-1" "0" "1"]) (tempsMinLower . ["" "-10" "-5" "-6" "-4" "-7" "-7"]) (tempsMax . ["" "9" "8" "10" "9" "7" "10"]) (tempsMaxUpper . ["" "11" "10" "12" "10" "10" "13"]) (tempsMaxLower . ["" "7" "5" "8" "6" "5" "7"]))
           ((area (name . "松本") (code . "48361")) (tempsMin . ["" "-7" "0" "-3" "0" "-2" "-1"]) (tempsMinUpper . ["" "-4" "2" "0" "2" "1" "1"]) (tempsMinLower . ["" "-8" "-2" "-6" "-1" "-6" "-5"]) (tempsMax . ["" "11" "9" "12" "9" "9" "12"]) (tempsMaxUpper . ["" "13" "11" "15" "12" "12" "15"]) (tempsMaxLower . ["" "9" "6" "11" "7" "7" "9"]))
           ]))
      ])
  (tempAverage (areas . [((area (name . "長野") (code . "48156")) (min . "-2.2") (max . "7.4")) ((area (name . "松本") (code . "48361")) (min . "-2.8") (max . "8.6"))]))
  (precipAverage (areas . [((area (name . "長野") (code . "48156")) (min . "6.3") (max . "15.9")) ((area (name . "松本") (code . "48361")) (min . "3.9") (max . "17.4"))]))
  )
 ]
