
;;2022-02-21 07:54
;;(jma-forecast-data "130000")

[
 ((publishingOffice . "気象庁")
  (reportDatetime . "2022-02-21T05:00:00+09:00")
  (timeSeries
   . [
      ((timeDefines . ["2022-02-21T05:00:00+09:00" "2022-02-22T00:00:00+09:00"])
       (areas
        . [
           ((area (name . "東京地方") (code . "130010")) (weatherCodes . ["100" "100"]) (weathers . ["晴れ" "晴れ"]) (winds . ["北西の風　２３区西部　では　はじめ　北の風　強く" "北西の風　後　北の風"]) (waves . ["１．５メートル" "０．５メートル"]))
           ((area (name . "伊豆諸島北部") (code . "130020")) (weatherCodes . ["210" "101"]) (weathers . ["くもり　昼過ぎ　から　時々　晴れ　所により　昼前　まで　雪か雨" "晴れ　時々　くもり"]) (winds . ["西の風　強く　新島　では　はじめ　西の風　非常に強く" "西の風　強く"]) (waves . ["３メートル　ただし　新島　では　４メートル　後　３メートル" "３メートル"]))
           ((area (name . "伊豆諸島南部") (code . "130030")) (weatherCodes . ["200" "201"]) (weathers . ["くもり　所により　雨か雪" "くもり　時々　晴れ"]) (winds . ["西の風　非常に強く　後　強く" "西の風　強く"]) (waves . ["６メートル　後　４メートル　ただし　三宅島　では　５メートル　後　４メートル" "４メートル"]))
           ((area (name . "小笠原諸島") (code . "130040")) (weatherCodes . ["201" "210"]) (weathers . ["くもり　時々　晴れ" "くもり　昼前　から　時々　晴れ"]) (winds . ["北の風　やや強く" "北の風"]) (waves . ["４メートル　うねり　を伴う" "４メートル　後　２．５メートル　うねり　を伴う"]))])
       )
      ((timeDefines . ["2022-02-21T06:00:00+09:00" "2022-02-21T12:00:00+09:00" "2022-02-21T18:00:00+09:00" "2022-02-22T00:00:00+09:00" "2022-02-22T06:00:00+09:00" "2022-02-22T12:00:00+09:00" "2022-02-22T18:00:00+09:00"])
       (areas
        . [
           ((area (name . "東京地方") (code . "130010")) (pops . ["0" "0" "0" "0" "0" "10" "0"]))
           ((area (name . "伊豆諸島北部") (code . "130020")) (pops . ["20" "10" "10" "10" "10" "10" "10"]))
           ((area (name . "伊豆諸島南部") (code . "130030")) (pops . ["20" "20" "20" "10" "20" "20" "10"]))
           ((area (name . "小笠原諸島") (code . "130040")) (pops . ["10" "10" "10" "10" "10" "10" "10"]))
           ]))
      ((timeDefines . ["2022-02-21T09:00:00+09:00" "2022-02-21T00:00:00+09:00" "2022-02-22T00:00:00+09:00" "2022-02-22T09:00:00+09:00"])
       (areas
        . [
           ((area (name . "東京") (code . "44132")) (temps . ["10" "10" "0" "9"]))
           ((area (name . "大島") (code . "44172")) (temps . ["10" "10" "3" "10"]))
           ((area (name . "八丈島") (code . "44263")) (temps . ["9" "9" "5" "11"]))
           ((area (name . "父島") (code . "44301")) (temps . ["18" "18" "13" "18"]))
           ]))
      ])
  )

 ;;週間予報
 ((publishingOffice . "気象庁")
  (reportDatetime . "2022-02-20T17:00:00+09:00")
  (timeSeries
   . [
      ((timeDefines . ["2022-02-21T00:00:00+09:00" "2022-02-22T00:00:00+09:00" "2022-02-23T00:00:00+09:00" "2022-02-24T00:00:00+09:00" "2022-02-25T00:00:00+09:00" "2022-02-26T00:00:00+09:00" "2022-02-27T00:00:00+09:00"])
       (areas
        . [
           ((area (name . "東京地方") (code . "130010")) (weatherCodes . ["100" "101" "101" "101" "101" "101" "201"]) (pops . ["" "10" "10" "10" "10" "20" "30"]) (reliabilities . ["" "" "A" "A" "A" "A" "A"]))
           ((area (name . "伊豆諸島北部") (code . "130020")) (weatherCodes . ["210" "101" "101" "101" "101" "101" "200"]) (pops . ["" "20" "20" "20" "20" "20" "40"]) (reliabilities . ["" "" "A" "A" "A" "A" "B"]))
           ((area (name . "伊豆諸島南部") (code . "130030")) (weatherCodes . ["200" "201" "201" "101" "201" "201" "202"]) (pops . ["" "30" "30" "20" "30" "30" "50"]) (reliabilities . ["" "" "A" "A" "A" "B" "C"]))
           ((area (name . "小笠原諸島") (code . "130040")) (weatherCodes . ["210" "101" "101" "201" "201" "201" "201"]) (pops . ["" "20" "20" "30" "30" "30" "30"]) (reliabilities . ["" "" "A" "A" "A" "A" "A"]))
           ])
       )
      
      ((timeDefines . ["2022-02-21T00:00:00+09:00" "2022-02-22T00:00:00+09:00" "2022-02-23T00:00:00+09:00" "2022-02-24T00:00:00+09:00" "2022-02-25T00:00:00+09:00" "2022-02-26T00:00:00+09:00" "2022-02-27T00:00:00+09:00"])
       (areas
        . [
           ((area (name . "東京") (code . "44132")) (tempsMin . ["" "0" "0" "0" "0" "1" "4"]) (tempsMinUpper . ["" "2" "2" "2" "2" "2" "6"]) (tempsMinLower . ["" "-1" "-1" "-1" "-1" "-1" "1"]) (tempsMax . ["" "11" "9" "10" "13" "15" "17"]) (tempsMaxUpper . ["" "12" "11" "12" "15" "18" "19"]) (tempsMaxLower . ["" "9" "8" "8" "11" "13" "14"]))
           ((area (name . "大島") (code . "44172")) (tempsMin . ["" "3" "3" "3" "4" "5" "9"]) (tempsMinUpper . ["" "5" "4" "5" "6" "8" "11"]) (tempsMinLower . ["" "1" "1" "1" "2" "3" "6"]) (tempsMax . ["" "11" "10" "12" "14" "15" "15"]) (tempsMaxUpper . ["" "12" "11" "13" "15" "17" "17"]) (tempsMaxLower . ["" "9" "9" "10" "12" "13" "13"]))
           ((area (name . "八丈島") (code . "44263")) (tempsMin . ["" "5" "6" "6" "8" "9" "11"]) (tempsMinUpper . ["" "7" "7" "8" "9" "11" "13"]) (tempsMinLower . ["" "4" "4" "4" "6" "8" "8"]) (tempsMax . ["" "11" "10" "12" "14" "16" "16"]) (tempsMaxUpper . ["" "13" "11" "13" "15" "17" "18"]) (tempsMaxLower . ["" "10" "8" "10" "12" "14" "15"]))
           ((area (name . "父島") (code . "44301")) (tempsMin . ["" "13" "14" "15" "15" "17" "18"]) (tempsMinUpper . ["" "15" "16" "16" "17" "18" "20"]) (tempsMinLower . ["" "12" "13" "13" "14" "15" "16"]) (tempsMax . ["" "18" "19" "19" "20" "22" "22"]) (tempsMaxUpper . ["" "20" "20" "20" "22" "23" "23"]) (tempsMaxLower . ["" "17" "18" "18" "19" "20" "21"]))
           ])
       )
      ])
  (tempAverage (areas . [((area (name . "東京") (code . "44132")) (min . "2.8") (max . "11.6")) ((area (name . "大島") (code . "44172")) (min . "4.7") (max . "12.2")) ((area (name . "八丈島") (code . "44263")) (min . "8.1") (max . "14.2")) ((area (name . "父島") (code . "44301")) (min . "15.8") (max . "20.8"))]))
  (precipAverage (areas . [((area (name . "東京") (code . "44132")) (min . "5.0") (max . "24.7")) ((area (name . "大島") (code . "44172")) (min . "16.6") (max . "56.8")) ((area (name . "八丈島") (code . "44263")) (min . "32.1") (max . "66.0")) ((area (name . "父島") (code . "44301")) (min . "2.6") (max . "15.5"))]))
  )
 ]
