;;(jma-forecast-data "070000")

[
 ((publishingOffice . "福島地方気象台")
  (reportDatetime . "2022-02-21T17:00:00+09:00")
  (timeSeries
   . [
      ((timeDefines . ["2022-02-21T17:00:00+09:00" "2022-02-22T00:00:00+09:00" "2022-02-23T00:00:00+09:00"])
       (areas
        . [
           ((area (name . "中通り") (code . "070010")) (weatherCodes . ["205" "204" "201"]) (weathers . ["くもり　夜のはじめ頃　雪　で　ふぶく" "くもり　明け方　一時　雪　で　ふぶく" "くもり　時々　晴れ"]) (winds . ["西の風　やや強く" "西の風　やや強く" "西の風"]))
           ((area (name . "浜通り") (code . "070020")) (weatherCodes . ["200" "201" "201"]) (weathers . ["くもり　所により　雪" "くもり　昼前　から　夕方　晴れ　所により　朝晩　雪" "くもり　時々　晴れ"]) (winds . ["西の風　やや強く　海上　では　西の風　強く" "西の風　やや強く　海上　では　はじめ　西の風　強く" "北西の風"]) (waves . ["２．５メートル" "２メートル" "１．５メートル"]))
           ((area (name . "会津") (code . "070030")) (weatherCodes . ["400" "402" "205"]) (weathers . ["雪　で　ふぶく" "雪　で　ふぶく　時々　くもり" "くもり　時々　雪"]) (winds . ["西の風　やや強く" "西の風　やや強く" "西の風"]))
           ]))
      ((timeDefines . ["2022-02-21T18:00:00+09:00" "2022-02-22T00:00:00+09:00" "2022-02-22T06:00:00+09:00" "2022-02-22T12:00:00+09:00" "2022-02-22T18:00:00+09:00"])
       (areas
        . [
           ((area (name . "中通り") (code . "070010")) (pops . ["50" "50" "30" "20" "30"]))
           ((area (name . "浜通り") (code . "070020")) (pops . ["30" "20" "10" "10" "20"]))
           ((area (name . "会津") (code . "070030")) (pops . ["70" "60" "60" "60" "70"]))
           ]))
      ((timeDefines . ["2022-02-22T00:00:00+09:00" "2022-02-22T09:00:00+09:00"])
       (areas
        . [
           ((area (name . "福島") (code . "36127")) (temps . ["-3" "1"]))
           ((area (name . "小名浜") (code . "36846")) (temps . ["-3" "5"]))
           ((area (name . "若松") (code . "36361")) (temps . ["-3" "0"]))
           ((area (name . "白河") (code . "36667")) (temps . ["-6" "2"]))
           ((area (name . "郡山") (code . "36476")) (temps . ["-4" "1"]))
           ((area (name . "相馬") (code . "36151")) (temps . ["-4" "3"]))
           ((area (name . "田島") (code . "36641")) (temps . ["-7" "-3"]))]))
      ])
  )

 ((publishingOffice . "福島地方気象台")
  (reportDatetime . "2022-02-21T17:00:00+09:00")
  (timeSeries
   . [
      ((timeDefines . ["2022-02-22T00:00:00+09:00" "2022-02-23T00:00:00+09:00" "2022-02-24T00:00:00+09:00" "2022-02-25T00:00:00+09:00" "2022-02-26T00:00:00+09:00" "2022-02-27T00:00:00+09:00" "2022-02-28T00:00:00+09:00"]) (areas . [((area (name . "中通り・浜通り") (code . "070100")) (weatherCodes . ["204" "201" "101" "101" "101" "201" "101"]) (pops . ["" "20" "20" "20" "20" "30" "20"]) (reliabilities . ["" "" "A" "A" "A" "A" "A"])) ((area (name . "会津") (code . "070030")) (weatherCodes . ["402" "205" "204" "200" "200" "206" "200"]) (pops . ["" "80" "50" "40" "30" "50" "40"]) (reliabilities . ["" "" "C" "B" "A" "C" "C"]))]))
      ((timeDefines . ["2022-02-22T00:00:00+09:00" "2022-02-23T00:00:00+09:00" "2022-02-24T00:00:00+09:00" "2022-02-25T00:00:00+09:00" "2022-02-26T00:00:00+09:00" "2022-02-27T00:00:00+09:00" "2022-02-28T00:00:00+09:00"]) (areas . [((area (name . "福島") (code . "36127")) (tempsMin . ["" "-2" "-2" "1" "1" "2" "2"]) (tempsMinUpper . ["" "-1" "0" "3" "2" "5" "3"]) (tempsMinLower . ["" "-4" "-4" "-1" "-2" "-3" "-1"]) (tempsMax . ["" "3" "5" "9" "12" "11" "12"]) (tempsMaxUpper . ["" "4" "7" "11" "14" "14" "15"]) (tempsMaxLower . ["" "1" "3" "7" "10" "9" "8"])) ((area (name . "若松") (code . "36361")) (tempsMin . ["" "-3" "-3" "-1" "-4" "-2" "0"]) (tempsMinUpper . ["" "-2" "-2" "0" "-2" "1" "1"]) (tempsMinLower . ["" "-6" "-6" "-6" "-9" "-7" "-6"]) (tempsMax . ["" "1" "1" "6" "8" "8" "8"]) (tempsMaxUpper . ["" "2" "3" "8" "10" "11" "11"]) (tempsMaxLower . ["" "-2" "-1" "4" "6" "6" "6"]))]))
      ])
  (tempAverage (areas . [((area (name . "福島") (code . "36127")) (min . "-0.6") (max . "8.2")) ((area (name . "若松") (code . "36361")) (min . "-2.7") (max . "5.3"))]))
  (precipAverage (areas . [((area (name . "福島") (code . "36127")) (min . "3.5") (max . "14.4")) ((area (name . "若松") (code . "36361")) (min . "9.4") (max . "20.8"))]))
  )
 ]
