;;(jma-forecast-data "130000")

[
 ((publishingOffice . "気象庁")
  (reportDatetime . "2022-02-22T17:00:00+09:00")
  (timeSeries
   . [
      ((timeDefines . ["2022-02-22T17:00:00+09:00" "2022-02-23T00:00:00+09:00" "2022-02-24T00:00:00+09:00"])
       (areas
        . [
           ((area (name . "東京地方") (code . "130010")) (weatherCodes . ["101" "111" "101"]) (weathers . ["晴れ　夜のはじめ頃　くもり" "晴れ　夕方　から　くもり" "晴れ　時々　くもり"]) (winds . ["北の風　やや強く" "北の風　２３区西部　では　後　北の風　やや強く" "北の風"]) (waves . ["１メートル" "０．５メートル　後　１メートル" "０．５メートル"]))
           ((area (name . "伊豆諸島北部") (code . "130020")) (weatherCodes . ["101" "101" "201"]) (weathers . ["晴れ　夜のはじめ頃　くもり" "晴れ　時々　くもり　所により　夜　雨か雪" "くもり　時々　晴れ"]) (winds . ["西の風　強く" "西の風　強く" "西の風　やや強く　後　北東の風"]) (waves . ["３メートル　ただし　新島　では　４メートル" "３メートル　後　２．５メートル　ただし　新島　では　４メートル　後　３メートル" "２メートル　後　１．５メートル　ただし　新島　では　３メートル　後　２メートル"]))
           ((area (name . "伊豆諸島南部") (code . "130030")) (weatherCodes . ["200" "200" "201"]) (weathers . ["くもり　所により　雨か雪" "くもり　所により　雨か雪" "くもり　時々　晴れ"]) (winds . ["西の風　強く" "西の風　強く" "西の風　強く　後　やや強く"]) (waves . ["４メートル" "４メートル" "３メートル　後　２．５メートル"]))
           ((area (name . "小笠原諸島") (code . "130040")) (weatherCodes . ["101" "201" "201"]) (weathers . ["晴れ　夜のはじめ頃　くもり" "くもり　昼過ぎ　まで　時々　晴れ" "くもり　時々　晴れ"]) (winds . ["北西の風" "北西の風　後　北の風" "北の風"]) (waves . ["３メートル　うねり　を伴う" "３メートル　うねり　を伴う" "２．５メートル　後　２メートル　うねり　を伴う"]))
           ]))
      ((timeDefines . ["2022-02-22T18:00:00+09:00" "2022-02-23T00:00:00+09:00" "2022-02-23T06:00:00+09:00" "2022-02-23T12:00:00+09:00" "2022-02-23T18:00:00+09:00"])
       (areas
        . [
           ((area (name . "東京地方") (code . "130010")) (pops . ["10" "0" "0" "10" "10"]))
           ((area (name . "伊豆諸島北部") (code . "130020")) (pops . ["10" "10" "10" "10" "20"]))
           ((area (name . "伊豆諸島南部") (code . "130030")) (pops . ["20" "20" "20" "10" "20"]))
           ((area (name . "小笠原諸島") (code . "130040")) (pops . ["10" "10" "10" "10" "10"]))
           ]))
      ((timeDefines . ["2022-02-23T00:00:00+09:00" "2022-02-23T09:00:00+09:00"]) (areas . [((area (name . "東京") (code . "44132")) (temps . ["-1" "9"])) ((area (name . "大島") (code . "44172")) (temps . ["3" "10"])) ((area (name . "八丈島") (code . "44263")) (temps . ["5" "9"])) ((area (name . "父島") (code . "44301")) (temps . ["14" "19"]))]))
      ])
  )

 ((publishingOffice . "気象庁")
  (reportDatetime . "2022-02-22T17:00:00+09:00")
  (timeSeries . [((timeDefines . ["2022-02-23T00:00:00+09:00" "2022-02-24T00:00:00+09:00" "2022-02-25T00:00:00+09:00" "2022-02-26T00:00:00+09:00" "2022-02-27T00:00:00+09:00" "2022-02-28T00:00:00+09:00" "2022-03-01T00:00:00+09:00"]) (areas . [((area (name . "東京地方") (code . "130010")) (weatherCodes . ["111" "101" "101" "101" "201" "101" "201"]) (pops . ["" "10" "10" "10" "30" "10" "30"]) (reliabilities . ["" "" "A" "A" "A" "A" "A"])) ((area (name . "伊豆諸島北部") (code . "130020")) (weatherCodes . ["101" "201" "101" "101" "201" "101" "201"]) (pops . ["" "20" "20" "20" "30" "20" "30"]) (reliabilities . ["" "" "A" "A" "B" "A" "B"])) ((area (name . "伊豆諸島南部") (code . "130030")) (weatherCodes . ["200" "201" "101" "101" "202" "101" "201"]) (pops . ["" "30" "20" "20" "50" "20" "30"]) (reliabilities . ["" "" "A" "A" "C" "A" "B"])) ((area (name . "小笠原諸島") (code . "130040")) (weatherCodes . ["201" "201" "200" "201" "201" "101" "101"]) (pops . ["" "30" "40" "30" "30" "20" "20"]) (reliabilities . ["" "" "B" "B" "A" "A" "A"]))])) ((timeDefines . ["2022-02-23T00:00:00+09:00" "2022-02-24T00:00:00+09:00" "2022-02-25T00:00:00+09:00" "2022-02-26T00:00:00+09:00" "2022-02-27T00:00:00+09:00" "2022-02-28T00:00:00+09:00" "2022-03-01T00:00:00+09:00"]) (areas . [((area (name . "東京") (code . "44132")) (tempsMin . ["" "0" "0" "1" "4" "2" "5"]) (tempsMinUpper . ["" "2" "2" "2" "5" "4" "7"]) (tempsMinLower . ["" "-1" "-1" "-1" "2" "0" "3"]) (tempsMax . ["" "9" "12" "15" "15" "16" "15"]) (tempsMaxUpper . ["" "11" "14" "17" "17" "18" "19"]) (tempsMaxLower . ["" "8" "10" "12" "13" "14" "13"])) ((area (name . "大島") (code . "44172")) (tempsMin . ["" "2" "4" "5" "8" "7" "8"]) (tempsMinUpper . ["" "5" "6" "7" "10" "9" "10"]) (tempsMinLower . ["" "1" "2" "3" "5" "4" "6"]) (tempsMax . ["" "9" "13" "14" "15" "16" "15"]) (tempsMaxUpper . ["" "12" "14" "16" "16" "18" "18"]) (tempsMaxLower . ["" "8" "11" "13" "13" "14" "14"])) ((area (name . "八丈島") (code . "44263")) (tempsMin . ["" "5" "7" "8" "10" "10" "11"]) (tempsMinUpper . ["" "7" "8" "10" "12" "11" "14"]) (tempsMinLower . ["" "4" "5" "6" "8" "8" "9"]) (tempsMax . ["" "9" "12" "15" "14" "16" "17"]) (tempsMaxUpper . ["" "11" "13" "16" "16" "18" "19"]) (tempsMaxLower . ["" "8" "10" "13" "13" "14" "15"])) ((area (name . "父島") (code . "44301")) (tempsMin . ["" "14" "16" "16" "17" "16" "17"]) (tempsMinUpper . ["" "16" "17" "17" "19" "18" "18"]) (tempsMinLower . ["" "13" "14" "14" "15" "15" "15"]) (tempsMax . ["" "19" "19" "20" "22" "21" "21"]) (tempsMaxUpper . ["" "20" "20" "21" "23" "22" "23"]) (tempsMaxLower . ["" "18" "18" "19" "20" "20" "20"]))]))])
  (tempAverage (areas . [((area (name . "東京") (code . "44132")) (min . "3.0") (max . "11.8")) ((area (name . "大島") (code . "44172")) (min . "4.9") (max . "12.4")) ((area (name . "八丈島") (code . "44263")) (min . "8.2") (max . "14.4")) ((area (name . "父島") (code . "44301")) (min . "15.9") (max . "20.9"))]))
  (precipAverage (areas . [((area (name . "東京") (code . "44132")) (min . "6.3") (max . "28.2")) ((area (name . "大島") (code . "44172")) (min . "18.6") (max . "60.2")) ((area (name . "八丈島") (code . "44263")) (min . "33.8") (max . "69.5")) ((area (name . "父島") (code . "44301")) (min . "2.8") (max . "15.0"))]))
  )
 ]
