;;(jma-forecast-data "070000")

[
 ((publishingOffice . "福島地方気象台")
  (reportDatetime . "2022-02-23T05:00:00+09:00")
  (timeSeries
   . [
      ((timeDefines . ["2022-02-23T05:00:00+09:00" "2022-02-24T00:00:00+09:00"])
       (areas
        . [
           ((area (name . "中通り") (code . "070010")) (weatherCodes . ["210" "210"]) (weathers . ["くもり　昼過ぎ　から　時々　晴れ　所により　昼前　まで　雪" "くもり　昼前　から　時々　晴れ　所により　朝晩　雪"]) (winds . ["西の風　日中　やや強く" "西の風　日中　やや強く"]))
           ((area (name . "浜通り") (code . "070020")) (weatherCodes . ["101" "101"]) (weathers . ["晴れ　時々　くもり" "晴れ　時々　くもり"]) (winds . ["北西の風　後　西の風　やや強く" "西の風　後　やや強く"]) (waves . ["２メートル　後　１．５メートル" "１．５メートル"]))
           ((area (name . "会津") (code . "070030")) (weatherCodes . ["402" "205"]) (weathers . ["雪　で　ふぶく　昼過ぎ　から　時々　くもり" "くもり　時々　雪"]) (winds . ["西の風　日中　やや強く" "西の風"]))
           ])
       )
      ((timeDefines . ["2022-02-23T06:00:00+09:00" "2022-02-23T12:00:00+09:00" "2022-02-23T18:00:00+09:00" "2022-02-24T00:00:00+09:00" "2022-02-24T06:00:00+09:00" "2022-02-24T12:00:00+09:00" "2022-02-24T18:00:00+09:00"])
       (areas
        . [
           ((area (name . "中通り") (code . "070010")) (pops . ["30" "10" "10" "20" "20" "10" "20"]))
           ((area (name . "浜通り") (code . "070020")) (pops . ["10" "10" "0" "10" "0" "0" "0"]))
           ((area (name . "会津") (code . "070030")) (pops . ["60" "50" "50" "50" "50" "40" "50"]))
           ])
       )
      ((timeDefines . ["2022-02-23T09:00:00+09:00" "2022-02-23T00:00:00+09:00" "2022-02-24T00:00:00+09:00" "2022-02-24T09:00:00+09:00"])
       (areas
        . [
           ((area (name . "福島") (code . "36127")) (temps . ["2" "2" "-3" "4"]))
           ((area (name . "小名浜") (code . "36846")) (temps . ["6" "6" "-3" "7"]))
           ((area (name . "若松") (code . "36361")) (temps . ["0" "0" "-5" "2"]))
           ((area (name . "白河") (code . "36667")) (temps . ["2" "2" "-5" "3"]))
           ((area (name . "郡山") (code . "36476")) (temps . ["1" "1" "-3" "3"]))
           ((area (name . "相馬") (code . "36151")) (temps . ["3" "3" "-4" "5"]))
           ((area (name . "田島") (code . "36641")) (temps . ["-3" "-3" "-7" "-1"]))])
       )
      ])
  )

 
 ((publishingOffice . "福島地方気象台")
  (reportDatetime . "2022-02-22T17:00:00+09:00")
  (timeSeries
   . [
      ((timeDefines . ["2022-02-23T00:00:00+09:00" "2022-02-24T00:00:00+09:00" "2022-02-25T00:00:00+09:00" "2022-02-26T00:00:00+09:00" "2022-02-27T00:00:00+09:00" "2022-02-28T00:00:00+09:00" "2022-03-01T00:00:00+09:00"])
       (areas
        . [
           ((area (name . "中通り・浜通り") (code . "070100"))
            (weatherCodes . ["201" "101" "101" "101" "201" "101" "201"])
            (pops . ["" "20" "20" "20" "30" "20" "30"])
            (reliabilities . ["" "" "A" "A" "A" "A" "A"]))
           ((area (name . "会津") (code . "070030"))
            (weatherCodes . ["402" "205" "200" "201" "260" "201" "260"])
            (pops . ["" "60" "40" "30" "50" "30" "50"])
            (reliabilities . ["" "" "B" "A" "C" "B" "C"]))
           ])
       )
      ((timeDefines . ["2022-02-23T00:00:00+09:00" "2022-02-24T00:00:00+09:00" "2022-02-25T00:00:00+09:00" "2022-02-26T00:00:00+09:00" "2022-02-27T00:00:00+09:00" "2022-02-28T00:00:00+09:00" "2022-03-01T00:00:00+09:00"])
       (areas
        . [
           ((area (name . "福島") (code . "36127")) (tempsMin . ["" "-1" "0" "0" "1" "2" "1"]) (tempsMinUpper . ["" "0" "2" "2" "4" "4" "3"]) (tempsMinLower . ["" "-4" "-1" "-2" "-4" "-3" "-3"]) (tempsMax . ["" "5" "8" "12" "10" "12" "11"]) (tempsMaxUpper . ["" "7" "10" "14" "13" "14" "15"]) (tempsMaxLower . ["" "3" "6" "10" "8" "10" "8"]))
           ((area (name . "若松") (code . "36361")) (tempsMin . ["" "-2" "-2" "-5" "-2" "-1" "-1"]) (tempsMinUpper . ["" "-1" "-1" "-2" "1" "1" "0"]) (tempsMinLower . ["" "-6" "-4" "-9" "-7" "-7" "-7"]) (tempsMax . ["" "3" "5" "8" "8" "8" "8"]) (tempsMaxUpper . ["" "4" "7" "11" "10" "10" "12"]) (tempsMaxLower . ["" "0" "1" "6" "5" "6" "6"]))
           ])
       )
      ])
  (tempAverage (areas . [((area (name . "福島") (code . "36127")) (min . "-0.5") (max . "8.3")) ((area (name . "若松") (code . "36361")) (min . "-2.6") (max . "5.5"))]))
  (precipAverage (areas . [((area (name . "福島") (code . "36127")) (min . "3.5") (max . "14.9")) ((area (name . "若松") (code . "36361")) (min . "9.3") (max . "20.6"))]))
  )
 ]
