;;(jma-forecast-data "130000")
[
 ((publishingOffice . "気象庁")
  (reportDatetime . "2022-02-21T20:00:00+09:00")
  (timeSeries
   . [
      ((timeDefines . ["2022-02-21T17:00:00+09:00" "2022-02-22T00:00:00+09:00" "2022-02-23T00:00:00+09:00"])
       (areas
        . [
           ((area (name . "東京地方") (code . "130010")) (weatherCodes . ["100" "110" "101"]) (weathers . ["晴れ" "晴れ　昼前　から　時々　くもり" "晴れ　時々　くもり"]) (winds . ["北西の風　２３区西部　では　北西の風　やや強く" "北の風　２３区西部　では　後　北の風　やや強く" "北の風"]) (waves . ["１メートル" "０．５メートル　後　１メートル" "０．５メートル"]))
           ((area (name . "伊豆諸島北部") (code . "130020")) (weatherCodes . ["100" "101" "101"]) (weathers . ["晴れ" "晴れ　時々　くもり" "晴れ　時々　くもり"]) (winds . ["西の風　強く" "西の風　強く" "西の風　強く"]) (waves . ["３メートル　ただし　新島　では　４メートル" "３メートル　ただし　新島　では　４メートル" "３メートル　後　２．５メートル　ただし　新島　では　４メートル　後　３メートル"]))
           ((area (name . "伊豆諸島南部") (code . "130030")) (weatherCodes . ["200" "200" "201"]) (weathers . ["くもり　八丈島　では　雨か雪" "くもり　所により　雨か雪" "くもり　時々　晴れ"]) (winds . ["西の風　強く" "西の風　強く" "西の風　強く"]) (waves . ["４メートル" "４メートル" "４メートル　後　３メートル"]))
           ((area (name . "小笠原諸島") (code . "130040")) (weatherCodes . ["200" "210" "101"]) (weathers . ["くもり" "くもり　昼前　から　時々　晴れ" "晴れ　時々　くもり"]) (winds . ["北の風" "北の風" "北の風"]) (waves . ["４メートル　うねり　を伴う" "４メートル　後　２．５メートル　うねり　を伴う" "２．５メートル　うねり　を伴う"]))
           ]))
      ((timeDefines . ["2022-02-21T18:00:00+09:00" "2022-02-22T00:00:00+09:00" "2022-02-22T06:00:00+09:00" "2022-02-22T12:00:00+09:00" "2022-02-22T18:00:00+09:00"])
       (areas
        . [
           ((area (name . "東京地方") (code . "130010")) (pops . ["0" "0" "10" "10" "0"]))
           ((area (name . "伊豆諸島北部") (code . "130020")) (pops . ["10" "10" "10" "10" "10"]))
           ((area (name . "伊豆諸島南部") (code . "130030")) (pops . ["20" "20" "20" "20" "20"]))
           ((area (name . "小笠原諸島") (code . "130040")) (pops . ["10" "10" "10" "10" "10"]))])
       )
      ((timeDefines . ["2022-02-22T00:00:00+09:00" "2022-02-22T09:00:00+09:00"])
       (areas
        . [
           ((area (name . "東京") (code . "44132")) (temps . ["-1" "9"]))
           ((area (name . "大島") (code . "44172")) (temps . ["3" "10"]))
           ((area (name . "八丈島") (code . "44263")) (temps . ["5" "11"]))
           ((area (name . "父島") (code . "44301")) (temps . ["14" "18"]))]))
      ])
  )

 ((publishingOffice . "気象庁")
  (reportDatetime . "2022-02-21T17:00:00+09:00")
  (timeSeries
   . [
      ((timeDefines . ["2022-02-22T00:00:00+09:00" "2022-02-23T00:00:00+09:00" "2022-02-24T00:00:00+09:00" "2022-02-25T00:00:00+09:00" "2022-02-26T00:00:00+09:00" "2022-02-27T00:00:00+09:00" "2022-02-28T00:00:00+09:00"]) (areas . [((area (name . "東京地方") (code . "130010")) (weatherCodes . ["110" "101" "101" "101" "101" "201" "101"]) (pops . ["" "10" "10" "10" "20" "30" "10"]) (reliabilities . ["" "" "A" "A" "A" "A" "A"])) ((area (name . "伊豆諸島北部") (code . "130020")) (weatherCodes . ["101" "101" "101" "101" "101" "200" "101"]) (pops . ["" "20" "20" "20" "20" "40" "20"]) (reliabilities . ["" "" "A" "A" "A" "B" "A"])) ((area (name . "伊豆諸島南部") (code . "130030")) (weatherCodes . ["200" "201" "101" "101" "101" "202" "101"]) (pops . ["" "30" "20" "20" "20" "50" "20"]) (reliabilities . ["" "" "A" "A" "A" "C" "A"])) ((area (name . "小笠原諸島") (code . "130040")) (weatherCodes . ["210" "101" "201" "200" "201" "201" "101"]) (pops . ["" "10" "30" "40" "30" "30" "20"]) (reliabilities . ["" "" "A" "B" "A" "A" "A"]))]))
      ((timeDefines . ["2022-02-22T00:00:00+09:00" "2022-02-23T00:00:00+09:00" "2022-02-24T00:00:00+09:00" "2022-02-25T00:00:00+09:00" "2022-02-26T00:00:00+09:00" "2022-02-27T00:00:00+09:00" "2022-02-28T00:00:00+09:00"]) (areas . [((area (name . "東京") (code . "44132")) (tempsMin . ["" "0" "1" "0" "1" "3" "2"]) (tempsMinUpper . ["" "2" "2" "2" "2" "5" "4"]) (tempsMinLower . ["" "-1" "-1" "-1" "0" "2" "1"]) (tempsMax . ["" "9" "9" "12" "15" "16" "16"]) (tempsMaxUpper . ["" "10" "11" "15" "17" "18" "19"]) (tempsMaxLower . ["" "7" "7" "10" "13" "14" "13"])) ((area (name . "大島") (code . "44172")) (tempsMin . ["" "2" "3" "4" "6" "8" "7"]) (tempsMinUpper . ["" "4" "5" "6" "7" "10" "9"]) (tempsMinLower . ["" "1" "1" "2" "4" "5" "4"]) (tempsMax . ["" "10" "11" "13" "15" "15" "16"]) (tempsMaxUpper . ["" "11" "13" "15" "16" "17" "18"]) (tempsMaxLower . ["" "8" "9" "11" "13" "14" "14"])) ((area (name . "八丈島") (code . "44263")) (tempsMin . ["" "5" "6" "7" "9" "11" "10"]) (tempsMinUpper . ["" "7" "8" "9" "11" "13" "12"]) (tempsMinLower . ["" "4" "5" "6" "7" "9" "7"]) (tempsMax . ["" "9" "11" "13" "15" "16" "16"]) (tempsMaxUpper . ["" "11" "12" "14" "16" "17" "18"]) (tempsMaxLower . ["" "8" "9" "11" "13" "14" "14"])) ((area (name . "父島") (code . "44301")) (tempsMin . ["" "14" "15" "16" "16" "17" "17"]) (tempsMinUpper . ["" "16" "16" "17" "17" "18" "19"]) (tempsMinLower . ["" "13" "13" "14" "15" "15" "15"]) (tempsMax . ["" "19" "19" "20" "21" "21" "21"]) (tempsMaxUpper . ["" "20" "20" "22" "22" "23" "22"]) (tempsMaxLower . ["" "18" "18" "19" "19" "20" "20"]))]))
      ])
  (tempAverage (areas . [((area (name . "東京") (code . "44132")) (min . "2.9") (max . "11.7")) ((area (name . "大島") (code . "44172")) (min . "4.8") (max . "12.3")) ((area (name . "八丈島") (code . "44263")) (min . "8.1") (max . "14.3")) ((area (name . "父島") (code . "44301")) (min . "15.9") (max . "20.8"))]))
  (precipAverage (areas . [((area (name . "東京") (code . "44132")) (min . "5.6") (max . "26.5")) ((area (name . "大島") (code . "44172")) (min . "17.6") (max . "58.5")) ((area (name . "八丈島") (code . "44263")) (min . "33.0") (max . "67.7")) ((area (name . "父島") (code . "44301")) (min . "2.7") (max . "15.3"))]))
  )
 ]
